---
title: GroundConductorSizeSet
classe: Autodesk.Revit.DB.Electrical.GroundConductorSizeSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# GroundConductorSizeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `groundConductorSizeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `groundConductorSizeSet.Size` | Int32 |
| `Void Clear()` | `groundConductorSizeSet.Clear()` | Void |
| `Boolean Contains(GroundConductorSize)` | `groundConductorSizeSet.Contains(item)` | Boolean |
| `Int32 Erase(GroundConductorSize)` | `groundConductorSizeSet.Erase(item)` | Int32 |
| `GroundConductorSizeSetIterator ForwardIterator()` | `groundConductorSizeSet.ForwardIterator()` | GroundConductorSizeSetIterator |
| `IEnumerator GetEnumerator()` | `groundConductorSizeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(GroundConductorSize)` | `groundConductorSizeSet.Insert(item)` | Boolean |
| `GroundConductorSizeSetIterator ReverseIterator()` | `groundConductorSizeSet.ReverseIterator()` | GroundConductorSizeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```